Revit 2024 API
ScheduleField.Definition Property
 The ScheduleDefinition that this field belongs to.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ScheduleDefinition Definition { get; }
Visual Basic
Public ReadOnly Property Definition As ScheduleDefinition
	Get
Visual C++
public:
property ScheduleDefinition^ Definition {
	ScheduleDefinition^ get ();
}
See Also
ScheduleField Class
Autodesk.Revit.DB Namespace